{
  "name": "goku",
  "owner": "sea-grass",
  "repo": "goku",
  "description": "A Static Site Generator written in Zig.",
  "type": "package",
  "topics": [
    "markdown",
    "static-site-generator",
    "yaml",
    "zig",
    "zig-package"
  ],
  "stars": 4,
  "forks": 1,
  "watchers": 1,
  "updated_at": "2025-10-08T11:28:15Z",
  "dependencies": [
    {
      "name": "httpz",
      "url": "git+https://github.com/karlseguin/http.zig?ref=dev#b1896f4b0bd30deb0351039b1ba470c9041f4117",
      "hash": "httpz-0.0.0-PNVzrE-8BgCUEVpFtYaUOFrWMqXHBu95eyIYRkXbyriy"
    },
    {
      "name": "custom_test_runner",
      "url": "./modules/custom-test-runner"
    },
    {
      "name": "bulma",
      "url": "./modules/bulma"
    },
    {
      "name": "htm",
      "url": "./modules/htm"
    },
    {
      "name": "htmx",
      "url": "./modules/htmx"
    },
    {
      "name": "lucide",
      "url": "./modules/lucide"
    },
    {
      "name": "md4c",
      "url": "./modules/md4c"
    },
    {
      "name": "mustach",
      "url": "./modules/mustach"
    },
    {
      "name": "sqlite",
      "url": "git+https://github.com/vrischmann/zig-sqlite?ref=master#59c06617d5b86546c0c739e73ae01d3965dbe8ce",
      "hash": "sqlite-3.48.0-F2R_a_uGDgCfOH5UEJYjuOCe-HixnLjToxOdEGAEM3xk"
    },
    {
      "name": "vhtml",
      "url": "./modules/vhtml"
    },
    {
      "name": "yaml",
      "url": "./modules/yaml"
    },
    {
      "name": "serve",
      "url": "git+https://github.com/sea-grass/serve?ref=main#a6822a7427fe03ef64406d31cbfda796c6d1da7f",
      "hash": "serve-0.0.1-LyESynYVAADMd4mawOoPHzdYiDE8zgumIwzrICXxiO5A"
    },
    {
      "name": "quickjs",
      "url": "git+https://github.com/sea-grass/quickjs-zig?ref=main#b6284947a7d9ce45ad78b5778df2e9e93ff16ce8",
      "hash": "quickjs-0.0.0-h7npNw4HAADzhLcIm9aLQ1uC9xOOqw-x0p13W_YyjzUc"
    }
  ],
  "readme": "# Goku\n\nGoku is a Static Site Generator written in Zig.\n\n## Introduction\n\nA static site generator (SSG) is typically run on some input source to produce a folder of html files, suitable for hosting on any HTTP server. Goku aims to be a SSG that can operate on a variety of input sources to generate static sites of up to hundreds of thousands of pages.\n\n## Notice\n\n> [!NOTE]  \n> Goku is in its early stages. The roadmap for features is prioritized on an as-needed basis. If you want to use Goku but it's lacking a key feature you need, feel free to check out the [contributing](#contributing) section of the readme.\n\n## Requirements\n\n- Officially supported Zig: `0.14.0` (you can get it from the [Zig Releases page](https://ziglang.org/download/))\n\n## Installation\n\nUse Zig to build the application binary. With a shell open in this project's directory:\n\n```\nzig build -Doptimize=ReleaseSafe\n```\n\nThe goku binary will be available at `zig-out/bin/goku`.\n\n## Usage\n\nSee [the docs](./site/pages/docs/site.md) on how to scaffold your first Goku site.\n\nOnce you've set up your site, you can use goku to build it:\n\n```\ngoku site -o build\n```\n\nIn the above example, Goku will scan `site/pages` recursively for all `.md` files, parse their yaml frontmatter for a `slug`, and then place the built sites into the `build` folder according to each page's `slug`. It will provide a build summary with the time elapsed and the source and destination directories.\n\nOnce you've built the site, you can try previewing it on your local machine using your preferred file server. For example, if you have `python3` on your system, you can try:\n\n```\nsh -c 'cd build; python3 -m http.server'\n```\n\n## Further Work\n\nIn its current form, Goku is very basic. There is no support for theming, asset management, etc. If there's a feature you'd like to see, please open a GitHub issue.\n\n## Contributing\n\nContributions are welcome, but I do request that if there's no open GitHub issue regarding your ideal change that you open one first! It's likely that I'm already working on the feature, so following this process helps to ensure that we're not spending double the time.\n\n## Bug reports\n\nIf you find a bug in the software, please report it using the GitHub issue tracker for this project's repository.",
  "owner_avatar_url": "https://avatars.githubusercontent.com/u/3868549?u=494545671e53ed3082ce917ca5f894785967d522&v=4",
  "releases": [
    {
      "tag_name": "v0.0.9",
      "name": "v0.0.9",
      "body": "## What's Changed\r\n* V0.0.9 dev by @sea-grass in https://github.com/sea-grass/goku/pull/10\r\n\r\n\r\n**Full Changelog**: https://github.com/sea-grass/goku/compare/v0.0.8...v0.0.9\r\n\r\n---\r\n\r\nThis is a small release with one bugfix and a modification to the output generated by the meta shortcode. The supported Zig version has been updated. Also, the Goku site template has been updated and a WIP rewrite of Goku which removes the dependency on sqlite was added to the repo.\r\n\r\n### Updated Zig version\r\n\r\nThe officially supported Zig version is now Zig `0.15.0-dev.885+e83776595`. You must upgrade to at least this Zig version when you upgrade to Goku 0.0.9.\r\n\r\n### Bug fixes\r\n\r\n- Fixed an issue where goku would fail if the output folder did not exist.\r\n\r\n### Shortcodes\r\n\r\n#### meta now rendered in table format\r\n\r\nThe `{{& meta }}` shortcode now renders in a table format rather than as a collection of tags.\r\nIn addition, the meta table now contains additional metadata fields from the page frontmatter.\r\n\r\n### Other\r\n\r\nThe updates in this section don't impact usage of Goku in this version.\r\n\r\n#### Goku data model rewrite\r\n\r\nIn the Goku repo, the `./experiment` folder contains a WIP version of the Goku site generator which does not use sqlite.\r\n\r\n#### Updated site template\r\n\r\nThe Goku site template has some new HTML metadata (lang, description, keywords).",
      "prerelease": false,
      "published_at": "2025-06-30T20:44:09Z",
      "html_url": "https://github.com/sea-grass/goku/releases/tag/v0.0.9",
      "assets": []
    },
    {
      "tag_name": "v0.0.8",
      "name": "v0.0.8",
      "body": "## What's Changed\r\n* v.0.0.8 development by @sea-grass in https://github.com/sea-grass/goku/pull/9\r\n\r\n\r\n**Full Changelog**: https://github.com/sea-grass/goku/compare/v0.0.7...v0.0.8\r\n\r\n---\r\n\r\nThis release contains one bugfix related to generating component assets. The behaviour of `goku init` has also changed slightly. Other than that, this is a small release, mostly focused on reorganizing the internals to support future development. As such, no feature changes are present.\r\n\r\n### Bug fixes\r\n\r\n- Fixed an issue where rendered component assets were not always written to the site's assets.\r\n\r\n### `goku init`\r\n\r\nThe init subcommand used to scaffold a Zig project so you could `goku init` and then run `zig build site` to build your Goku site. The suggested path forward in the near future for Goku sites will be to use Goku standalone, so these assets have been removed from the site template.\r\n\r\nIn addition, an example component has been added to the site template.\r\n\r\n### Dependencies\r\n\r\n- Removed zap\r\n- Removed clap\r\n- Removed ./modules/quickjs\r\n- Added quickjs-zig\r\n\r\n### Serve extracted to a separate repo\r\n\r\nIn a previous version, the `goku preview` command was added. Since it's been added, it's gained dynamic dispatch capabilities and an experimental in-browser page editor. As its capabilities grew, it was clear that there were two distinct modes of \"previewing\" the site: the kind during development where you want to iterate on your content and preview the changes and the other where you check out the site as a sanity check before deploying it to your production server. I believe Goku should support the development use case as a priority, since it has intimate knowledge of your site's source code and how the site is generated. I think the second type should be handled by other tools which only need to know about serving static files over HTTP. So, part of the Goku codebase has been split into a separate repository as a tool called Serve.\r\n\r\nServe now lives in its own Git repo at [sea-grass/serve](https://github.com/sea-grass/serve.git).\r\n\r\nThe `goku preview` still stands up an HTTP server with `httpz` directly, but with a focus on dynamic dispatch rather than a read-only preview of the site. This stance may lead to more diagnostic or interactive information being shown in preview mode by default than before.\r\n\r\n### QuickJS compilation extracted to a separate repo\r\n\r\nIn the near future, I plan to extract the component rendering aspects of Goku to a standalone tool/library. Once that's done, Goku won't need to depend directly on QuickJS anymore. So, the configuration to handle compiling QuickJS has been extracted to a separate repo, which lives at [sea-grass/quickjs-zig](https://github.com/sea-grass/quickjs-zig).\r\n",
      "prerelease": false,
      "published_at": "2025-04-20T20:30:36Z",
      "html_url": "https://github.com/sea-grass/goku/releases/tag/v0.0.8",
      "assets": []
    },
    {
      "tag_name": "v0.0.7",
      "name": "v0.0.7",
      "body": "## What's Changed\r\n* v0.0.7 by @sea-grass in https://github.com/sea-grass/goku/pull/8\r\n\r\n\r\n**Full Changelog**: https://github.com/sea-grass/goku/compare/v0.0.6...v0.0.7\r\n\r\n---\r\n\r\nThis is a big release for Goku and sets the stage for its future development. Keep in mind that currently many aspects of Goku are in flux and may change dramatically between releases. If this is a concern, I'd be more than happy to consider your usecase; just [open an issue](https://github.com/sea-grass/goku/issues/new) and let's chat.\r\n\r\nThis release is loaded and spans improvements across many areas. It includes changes to the development experience, new server-side rendered JS component support, an updated dependency to the latest stable Zig version, some default theme updates, the inclusion of an experimental in-browser page editor, improved documentation, static file support, and a site scaffolding tool.\r\n\r\nThis is quite a packed release, but the existing implementation is definitely showing its limitations. There will be bugs. If you encounter any bugs or notice odd behaviour, don't hesitate to open an issue on the GitHub repo.\r\n\r\nWithout further ado, here's an overview of the changes for this release.\r\n\r\n### Updated Zig version\r\n\r\nThe officially supported Zig version is now Zig `0.14.0`. You must upgrade to at least this Zig version when you upgrade to Goku 0.0.7.\r\n\r\n### Goku subcommands\r\n\r\nThe Goku CLI has become more useful to more fully capture the site creation and editing workflows. It now ships with three subcommands: `goku init`, `goku build`, and `goku preview`.\r\n\r\n#### `goku init`\r\n\r\nGetting a Goku site set up is only a few files, but that work can still be a hurdle for creating your first website or your tenth. So, the `goku init` subcommand was added to speed up working on a Goku site by scaffolding a blank site directory.\r\n\r\n#### `goku build`\r\n\r\nTo support additional functionality, the default behaviour has been moved to a subcommand `goku build`, which will build the target site. The same command line flags as before are supported.\r\n\r\n#### `goku preview`\r\n\r\nThis command builds the site and spins up a local HTTP server to allow you to preview it as it might be presented when you host it elsewhere.\r\n\r\nThe server has dynamic dispatch capabilities - meaning it builds pages on demand, enabling a nicer iteration process when you modify your pages and want to preview your changes. The ultimate goal would be to support live reload à la websockets so you don't need to refresh your browser when you make a change.\r\n\r\nIn addition, the preview server has the experimental inline editor feature, which will be detailed in a further section.\r\n\r\n### Default theme\r\n\r\nThe `{{& theme.body}}` now correctly injects a script tag for `htmx.js`.\r\n\r\n### Components\r\n\r\nA brand new feature for Goku is components. You can define JS modules which you can reference within your templates to achieve server-side rendering. This feature is supported by the quickjs runtime. The runtime is intentionally limited for now; it does not provide any of the QuickJS runtime's standard libraries. However, there are a limited number of NPM modules that are available out-of-the-box, in addition to a special module allowing you to make use of page-specific data.\r\n\r\nGoku provides a built-in module, `goku`, will a single export, `html`. This is simply a wrapper around `htm` and `vhtml` which can help you to achieve a more composable component framework with little effort.\r\n\r\nA simple component file might look like:\r\n\r\n```\r\nimport { html } from 'goku';\r\nconst MyButton = () => html`<button class=\"my-button\"/>`;\r\nexport const render = () => html`<${MyButton}>Click me!<//>`;\r\nexport const style = () => `\r\n.my-button {\r\n  color: white;\r\n  background: #24f;\r\n  height: 42px;\r\n  padding: .5em 2em;\r\n}\r\n`;\r\n```\r\n\r\nYou don't _need_ to use the `html` helper though. Even simpler:\r\n\r\n```\r\nexport const render = () => `<button class=\"my-button\">Click me!</button>`;\r\nexport const style = () => `\r\n.my-button {\r\n  color: white;\r\n  background: #24f;\r\n  height: 42px;\r\n  padding: .5em 2em;\r\n}\r\n`;\r\n```\r\n\r\nGoku also provides a built-in module, `site`, which allows you to access the `site_root` that you set from the command line when building Goku. Other site properties may be added as needed (or upon request via GitHub issue).\r\n\r\n### `?editor`\r\n\r\nWhen you run `goku preview`, you can view your site, edit it, and refresh to view your changes, all without restarting Goku. A WIP method of editing your content has been added in pair, the web editor.\r\n\r\nWhen you include the `?editor` query in the URL, you will be able to edit the file content, save it, and view the changes right away.\r\n\r\nAs mentioned earlier in the changelog, this feature is experimental. I'm investigating ways to reduce the amount of steps for users to get up and running with a Goku site and in-browser editor support is part of that.\r\n\r\n### Improved documentation\r\n\r\nThe documentation has been updated to include a fancy almost-no-JS example code preview. Some other pages have received updates as well. In general, however, the documentation still needs some work.\r\n\r\n### Static file support\r\n\r\nThis feature came from a requirement of one website which had loads of images and other assets. Currently, this is locked behind a build step and not included in the mainline Goku binary. See the `Goku` build-time API for the command.\r\n",
      "prerelease": false,
      "published_at": "2025-03-20T21:29:29Z",
      "html_url": "https://github.com/sea-grass/goku/releases/tag/v0.0.7",
      "assets": []
    },
    {
      "tag_name": "v0.0.6",
      "name": "Goku v0.0.6",
      "body": "## What's Changed\r\n* v0.0.6 by @sea-grass in https://github.com/sea-grass/goku/pull/7\r\n\r\n\r\n**Full Changelog**: https://github.com/sea-grass/goku/compare/v0.0.5...v0.0.6\r\n\r\n---\r\n\r\nThis release is a quick follow-up to the previous release to fix a bug with the theme shortcodes.\r\n\r\n### Shortcodes\r\n\r\n- `{{& theme.head }}` now correctly references theme assets according to the `url_prefix`, if provided.\r\n",
      "prerelease": false,
      "published_at": "2024-11-26T18:03:56Z",
      "html_url": "https://github.com/sea-grass/goku/releases/tag/v0.0.6",
      "assets": []
    },
    {
      "tag_name": "v0.0.5",
      "name": "Goku v0.0.5",
      "body": "## What's Changed\r\n* v0.0.5 by @sea-grass in https://github.com/sea-grass/goku/pull/6\r\n\r\n\r\n**Full Changelog**: https://github.com/sea-grass/goku/compare/v0.0.4...v0.0.5\r\n\r\n---\r\n\r\nThis release contains many changes that are under the hood to support future features. User-facing changes include a more recent supported Zig version, updates to page parameters, more informative error messages, updates to shortcodes, and improvements to the markdown renderer.\r\n\r\n### Updated Zig version\r\n\r\nThe officially supported Zig version is now Zig `0.14.0-dev.1911+3bf89f55c`. You must upgrade to at least this Zig version when you upgrade to Goku v0.0.5.\r\n\r\n### Page Parameters\r\n\r\n- `template` is now a required parameter\r\n\r\n### More informative error messages\r\n\r\nPrior to v0.0.5, Goku would print unhelpful errors, for example `FileNotFound` when a template that a page references is missing. Now Goku does a better job at anticipating these errors and suggesting some potential fixes in some cases.\r\n\r\nError reporting was improved for these cases:\r\n\r\n- If pages dir is missing, suggests to create it\r\n- If templates dir is missing, suggests to create it\r\n- If required frontmatter fields slug, title, or template are missing,\r\n  prints specific message\r\n- If a page references a non-existent template, an informative error is\r\n  printed\r\n- If a template is empty, an informative error is printed\r\n\r\n### Shortcodes\r\n\r\n- `{{& collections.*.list}}` now sorts entries by date descending then by title ascending. If the entry has a date, it is printed alongside the title in the rendered html.\r\n\r\n### Markdown renderer\r\n\r\nGoku uses `md4c` for its markdown rendering, which provides a callback-style interface for customizing how the document is processed. Markdown features have been implemented as required for the goku site, which means that it doesn't yet fully render all possible markdown.\r\n\r\nIn this release, Goku now properly renders inline `code` and `strong` content in markdown content.\r\n\r\nIf you need more support for other markdown features, feel free to open an issue in this repository. Better yet, check out `src/markdown.zig` and open a PR with your changes.",
      "prerelease": false,
      "published_at": "2024-11-26T17:50:28Z",
      "html_url": "https://github.com/sea-grass/goku/releases/tag/v0.0.5",
      "assets": []
    },
    {
      "tag_name": "v0.0.4",
      "name": "Goku v0.0.4",
      "body": "## What's Changed\r\n* v0.0.4 by @sea-grass in https://github.com/sea-grass/goku/pull/3\r\n\r\n\r\n**Full Changelog**: https://github.com/sea-grass/goku/compare/v0.0.3...v0.0.4\r\n\r\nThis release updates the officially supported Zig version, adds some features to improve the experience of building and previewing Goku sites, automates some of the work for supporting alternate site roots, and includes some behind-the-scenes changes to support more advanced features and to pave the way for user-defined themes.\r\n\r\n### Updated Zig version\r\n\r\nThe officially supported Zig version is now Zig `0.14.0-dev.1710+8ee52f99c`. You must upgrade to at least this Zig version when you upgrade to Goku 0.0.4.\r\n\r\n### Getting started\r\n\r\n#### build.zig\r\n\r\nGoku now exposes a build-time API. To learn how to use it, check out [Getting Started](/getting-started) in the docs.\r\n\r\nBriefly, you can use it in your build.zig like this:\r\n\r\n```\r\nconst std = @import(\"std\");\r\nconst Goku = @import(\"goku\").Goku;\r\n\r\npub fn build(b: *std.Build) !void {\r\n  const target = b.standardTargetOptions(.{});\r\n  const optimize = b.standardOptimizeOption(.{});\r\n  const goku_dep = b.dependency(\"goku\", .{ .target = target, .optimize = optimize });\r\n  \r\n  const site_source_path = b.path(\"site\");\r\n  const site_dest_path = b.path(\"build\");\r\n  \r\n  const build_site = Goku.build(b, goku_dep, site_source_path, site_dest_path);\r\n  const build_site_step = b.step(\"site\", \"Build the site\");\r\n  build_site_step.dependOn(&build_site.step);\r\n  \r\n  const serve_site = Goku.serve(b, goku_dep, site_dest_path);\r\n  const serve_site_step = b.step(\"serve\", \"Serve the site\");\r\n  serve_site_step.dependOn(&build_site.step);\r\n  serve_site_step.dependOn(&serve_site.step);\r\n}\r\n```\r\n\r\n### Themes\r\n\r\nGoku does not yet support user-defined themes, but some shortcodes (`{{& theme.head}}` and `{{& theme.body}}`) have been added to make the transition to themes smoother once they are supported.\r\n\r\nPreviously, users had to include `bulma.css` and `htmx.js` to their templates manually. The suggested migration path is to replace these instances with the shortcodes.\r\n\r\n### Shortcodes\r\n\r\nSome shortcodes were added in this release.\r\n\r\n- `{{& theme.head}}` - Render the theme's assets and metadata (typically inside `<head>` in your template)\r\n- `{{& theme.body}}` - Render the theme's scripts (typically right before the end of `<body>` in your template)\r\n\r\n### Site root\r\n\r\nThis release simplifies the usage of site_root. When rendering markdown pages, Goku now automatically prefixes sitewide urls with the url prefix supplied at build-time.\r\n\r\nIf your site is hosted at some url path that is not the root (e.g. if your Goku site root is at `http://example.com/blog`) then you needed to do two things: set the url prefix when building your site, and prefix all links in your content with `{{site_root}}`. Now, you don't need to prefix your links in your content at all.\r\n\r\nSuggested migration path is to remove `{{site_root}}` from your pages. If your pages only had the `allow_html: true` parameter because of `site_root` usage, you can remove it.\r\n\r\nNote that templates still require the usage of `{{site_root}}` (since the automatic insertion of `site_root` only occurs during markdown rendering).",
      "prerelease": false,
      "published_at": "2024-10-15T17:12:30Z",
      "html_url": "https://github.com/sea-grass/goku/releases/tag/v0.0.4",
      "assets": []
    },
    {
      "tag_name": "v0.0.3",
      "name": "Goku v0.0.3",
      "body": "## What's Changed\r\n* v0.0.3 by @sea-grass in https://github.com/sea-grass/goku/pull/2\r\n\r\n\r\n**Full Changelog**: https://github.com/sea-grass/goku/compare/v0.0.2...v0.0.3\r\n\r\nThis release includes basic support for collections (a way to group pages in order to link to and search through them), improvements for published sites at subpaths, and some UX improvements at when building a Goku site, in the form of more helpful error messages.\r\n\r\n### Page Parameters\r\n\r\nPages now support some additional parameters.\r\n\r\nAdded:\r\n\r\n- `collection: <name>` - Add this page to the collection named `<name>`.\r\n- `date: <date>` - This date will be used for sorting when displaying a list of pages inside a collection.\r\n- `description: <string>` - An optional piece of metadata that may be used inside of a template.\r\n\r\n### Site root\r\n\r\nIf you want to publish your site as the subpath of some domain, you need to let Goku know where the root of the built site will live, in order for it to produce correct links among assets and pages.\r\n\r\nTo use this feature, you need to do two things. 1) You need to provide the url prefix while building your site; and 2) You need to use the `{{site_root}}` shortcode wherever you create links or assets. (Note that `site_root` is automatically taken into account in shortcodes such as `collections.<name>.list`.)\r\n\r\nWhen building, you can specify the site root with the `-p` (or `--prefix`) argument:\r\n\r\n```shell-session\r\n$ goku site -o build -p my-site\r\n```\r\n\r\nThen, the site_root will be available to shortcodes, templates, and pages.\r\n\r\nNote that all page slugs are always relative to the site root.\r\n\r\n\r\n### Bug fixes\r\n\r\n- Fixed issue where an absolute build path would cause the program to crash\r\n\r\n### Collections\r\n\r\nYou can add a Page to a Collection using the `collection` page parameter. This allows you to group pages for ordering and viewing. See the docs for more information.\r\n\r\n### Shortcodes\r\n\r\nIn an effort to use standard lingo to communicate about Goku's features, a Shortcode is an identifier or pattern that corresponds to some data retrieval/html rendering within a template.\r\n\r\nPre-0.0.3, these shortcodes were available:\r\n\r\n- `{{& content}}` - Render the page content (i.e. the HTML generated from the page markdown content).\r\n- `{{title}}` - Render the page title, specified by the page parameter `title`.\r\n- `{{& lucide.<icon name>}}` - Embed the SVG for the corresponding icon in the lucide icon library.\r\n\r\nIn this version, these shortcodes were added:\r\n\r\n- `{{& meta}}` - Render some of the page parameters as tags.\r\n- `{{& collections.<collection name>.list}}` - Render a list of links for all of the pages in the corresponding collection.\r\n-  `{{& collections.<collection name>.latest}}` - Render a link to the page in the corresponding collection with the latest date (based on its frontmatter `date` parameter).\r\n- `{{site_root}}` - Use in conjunction with the `--prefix` command line argument to create links relative to your the site root.\r\n\r\n### Theming\r\n\r\n#### Added HTMX\r\n\r\nGoku now includes `htmx` in addition to `bulma` to every built site.\r\n\r\n#### Default theme\r\n\r\nNote that Goku doesn't necessarily support the concept of \"themes\" yet. The \"default theme\" could be considered to be the combination of shortcodes, UI libraries (lucide, htmx, bulma), and templates that are used in a site. The choice of shortcodes and UI libraries aren't customizable at this stage. On the other hand, templates must be entirely user-defined. So, you can make use of the \"default theme\" by referencing the templates for Goku's own site (see the source code).",
      "prerelease": false,
      "published_at": "2024-09-16T22:27:14Z",
      "html_url": "https://github.com/sea-grass/goku/releases/tag/v0.0.3",
      "assets": []
    },
    {
      "tag_name": "v0.0.2",
      "name": "Goku v0.0.2",
      "body": "- Mustache templates are now supported by Goku (using the [mustach](https://github.com/RekGRpth/mustach) library)\r\n- A `site` folder must now contain a `templates` directory with at least one template\r\n- A page in `site/pages` must now contain a `template: path/to/template.html` frontmatter, which resolves to a path within the site's Templates directory (e.g. resolves to `site/templates/path/to/template.html`)\r\n- A page may optionally be parsed by the template engine itself by specifying the `allow_html: true` frontmatter.\r\n- [Bulma.css](https://bulma.io/) is now added to a site's output directory automatically. You can reference it in your templates at the url `/bulma.css`.\r\n- [Lucide](https://lucide.dev/) icons are available to use within your templates. For example, you can insert `{{&lucide.sailboat}}` to embed the icon in your template. Note that you can also use Lucide icons in your pages if you add `allow_html: true`.\r\n\r\nThis release also includes some internal changes, like the use of SQLite to index the site before building.",
      "prerelease": false,
      "published_at": "2024-08-30T20:37:44Z",
      "html_url": "https://github.com/sea-grass/goku/releases/tag/v0.0.2",
      "assets": []
    },
    {
      "tag_name": "v0.0.1",
      "name": "Goku v0.0.1",
      "body": "- Initial release",
      "prerelease": false,
      "published_at": "2024-08-30T20:03:04Z",
      "html_url": "https://github.com/sea-grass/goku/releases/tag/v0.0.1",
      "assets": []
    }
  ],
  "owner_company": null,
  "owner_location": "Montreal, QC",
  "owner_blog": "http://sea-grass.github.io",
  "owner_twitter_username": null,
  "owner_followers": 24,
  "owner_following": 22,
  "owner_created_at": "2013-03-14T20:51:36Z",
  "homepage": "http://christophergrass.com/goku/",
  "license": "MIT",
  "category": "library"
}