{
  "name": "proxy-signatures",
  "owner": "jedisct1",
  "repo": "proxy-signatures",
  "description": "Proxy Signatures with Delegation by Warrant.",
  "type": "package",
  "topics": [
    "delegation",
    "proxy",
    "signatures",
    "warrant",
    "zig-package"
  ],
  "stars": 2,
  "forks": 0,
  "watchers": 1,
  "updated_at": "2025-10-03T11:33:36Z",
  "readme": "# Proxy Signatures with Delegation by Warrant\n\nProxy signatures with delegation by warrant, over the Ristretto255 group.\n\nThis library implements classic proxy signatures with “partial delegation with warrant” and binds each delegation to the designated proxy’s public key to prevent transfer.\n\nUse it when an owner must stay accountable while a separate component signs on the owner’s behalf without learning the owner’s long‑term secret.\n\nA delegation is tied to exactly one proxy by hashing the proxy’s public key into the authenticated warrant/commitment. The proxy derives a special signing key that cannot be used to create new delegations (non‑transferable by construction). Warrant semantics (expiry, scope, etc.) are application‑defined and shipped as bytes that can be the serialization of a structure.\n\n## Quick Start\n\n### Zig\n\n```zig\nconst std = @import(\"std\");\nconst proxy_signatures = @import(\"proxy-signatures\");\nconst KeyPair = proxy_signatures.KeyPair;\nconst DelegationToken = proxy_signatures.DelegationToken;\nconst ProxyPublicContext = proxy_signatures.ProxyPublicContext;\n\npub fn main() !void {\n    // Original signer A and designated proxy B\n    const a = KeyPair.new();\n    const b = KeyPair.new();\n\n    // A creates a warrant describing scope/expiry/purpose (free-form bytes)\n    const warrant = \"Proxy B may sign for A until 2026-12-31 for invoices only\";\n    const token = try DelegationToken.create(&a, &b.pk, warrant);\n    std.debug.assert(try token.verify(&a.pk));\n\n    // B derives proxy signing keys bound to this delegation\n    const keys = try proxy_signatures.deriveProxyKeys(&b, &a.pk, &token);\n    const ctx = try ProxyPublicContext.init(warrant, token.rw, keys.pk);\n\n    // B signs as proxy\n    const msg = \"Invoice #4387 approved\";\n    const sig = try proxy_signatures.proxySign(&keys.sk, msg);\n\n    // Anyone can verify with (A_pub, B_pub) + public context\n    const ok = try proxy_signatures.proxyVerify(&a.pk, &b.pk, msg, &sig, &ctx);\n    std.debug.assert(ok);\n}\n```\n\n### Rust\n\n```toml\n[dependencies]\nproxy-signatures = \"0\"\n```\n\n```rust\nuse proxy_signatures::{DelegationToken, KeyPair, ProxyPublicContext, Result};\n\nfn main() -> Result<()> {\n    // Original signer A and designated proxy B\n    let a = KeyPair::new()?;\n    let b = KeyPair::new()?;\n\n    // A creates a warrant describing scope/expiry/purpose (free-form bytes)\n    let warrant = b\"Proxy B may sign for A until 2026-12-31 for invoices only\";\n    let token = DelegationToken::create(&a, &b.pk, warrant)?;\n    assert!(token.verify(&a.pk)?);\n\n    // B derives proxy signing keys bound to this delegation\n    let keys = proxy_signatures::derive_proxy_keys(&b, &a.pk, &token)?;\n    let ctx = ProxyPublicContext::from_token(&token, keys.pk);\n\n    // B signs as proxy\n    let msg = b\"Invoice #4387 approved\";\n    let sig = proxy_signatures::proxy_sign(&keys.sk, msg)?;\n\n    // Anyone can verify with (A_pub, B_pub) + public context\n    let ok = proxy_signatures::proxy_verify(&a.pk, &b.pk, msg, &sig, &ctx)?;\n    assert!(ok);\n    Ok(())\n}\n```\n\n## API Overview\n\nThe `KeyPair` type represents an original signer capable of creating delegations.\n\nA `DelegationToken` carries the warrant bytes together with a commitment and is explicitly tied to the designated proxy’s public key. \n\nA proxy uses `derive_proxy_keys` or `derive_proxy_key_pair` to obtain the special proxy key material that is valid only under the delegation. Messages are signed with `proxy_sign` and verified with `proxy_verify`, which takes the owner and proxy public keys alongside a `ProxyPublicContext` describing the warrant, commitment, and derived proxy public key needed for verification.\n\n## How It Works (informal)\n\n- Delegation: the owner authenticates the warrant and commitment while hashing the proxy’s public key, yielding a token {warrant, commitment, auth scalar} that verifies under the owner key.\n- Derivation: the proxy verifies the token and derives a proxy secret/public key from (token + its own key).\n- Signing: the proxy signs messages with the derived key using Schnorr over Ristretto255.\n- Verification: verifiers recompute the bound proxy public key from (owner key, proxy key, warrant, commitment) and check the Schnorr signature against it.\n\nThis is a simple and efficient alternative to traditional signature chains when warrants change frequently and verification cannot be cached. Only one signature verification is required, and delegation is ensured by the cryptographic structure itself.\n\n## In Practice: What This Enables\n\nMost systems have one accountable owner and many components that must act on its behalf. Proxy signatures express this cleanly: the owner issues a warrant‑backed delegation to one proxy; the proxy derives a special signing key; verifiers check signatures against the owner key, proxy key, and warrant.\n\nConcrete patterns:\n\n- CDN Operations: Proxy signatures are useful in CDN scenarios where the owner keeps the root key offline while delegating to CDN infrastructure:\n  - Signed URLs: CDN generates signed URLs with time- and path-scoped warrants. When warrants expire, URL generation automatically stops - no root key rollover needed.\n  - Edge Authentication: Edge nodes validate requests and sign responses locally using proxy keys. Warrants encode geographic restrictions, content types, or user agent policies for fine-grained access control at the edge.\n  - Distributed Token Generation: Edge nodes generate signed authentication tokens for client requests without origin server involvement, reducing latency while maintaining cryptographic authenticity.\n  - Multi-CDN Strategy: Primary CDN delegates to secondary CDNs for specific regions or content types. Each provider receives a non-transferable delegation bound to their public key.\n\n- Regional JWT issuance: An auth server delegates JWT signing to regional services. Warrant encodes audiences, lifetimes, and an identifier for logging. Regions sign locally; verifiers use owner key + region key + public context.\n\n- CI release signing: Security holds the product key; CI gets a delegation limited to repo/version window. CI derives during the job and signs release checksums. Users verify with org key + CI key and read the warrant for scope.\n\n- Device fleets: Manufacturers delegate to operators per device class/region/window. Devices verify with manufacturer key + operator key and display/log the warrant. Rotate by issuing a new warrant or letting old ones expire.\n\n- Integration pattern: Exchange public keys and a one‑time delegation over your control plane. The proxy keeps only its own key and the token. Each signature includes compact public context (warrant + commitment) so verifiers can check without calling home.\n\n## Design Notes and Non‑Goals\n\n- Non‑transferable by design: the proxy’s public key is bound into the delegation, and proxy keys are a distinct type that cannot create further delegations.\n- Policy in the warrant: expiry, scope, audiences, identifiers, etc. live in warrant bytes; applications must parse and enforce them.\n- Single hop only: owner → one proxy. No chains, multi‑hop, or threshold delegation in scope.\n\n## References\n\nThe construction follows the original proxy‑signature notion by Mambo, Usuda and Okamoto (IEICE Trans. Fundamentals E79‑A(9), 1996) and the “partial delegation with warrant” refinement by Kim, Park and Won (ICICS 1997, LNCS 1334). For definitions and security analysis, see the work by Boldyreva, Palacio and Warinschi (IACR ePrint 2003/096; Journal of Cryptology 25(1), 2012).",
  "owner_avatar_url": "https://avatars.githubusercontent.com/u/124872?v=4",
  "releases": [
    {
      "tag_name": "0.2.0",
      "name": "0.2.0",
      "body": "",
      "prerelease": false,
      "published_at": "2025-10-02T22:03:12Z",
      "html_url": "https://github.com/jedisct1/proxy-signatures/releases/tag/0.2.0",
      "assets": []
    }
  ],
  "owner_bio": "Get my public keys here: https://sk.tl/7CPRo8kn",
  "owner_company": null,
  "owner_location": "Antibes, France",
  "owner_blog": "https://00f.net",
  "owner_twitter_username": "jedisct1",
  "owner_followers": 4143,
  "owner_following": 195,
  "owner_created_at": "2009-09-09T10:20:57Z",
  "license": "MIT",
  "category": "library"
}