{
  "name": "Zig-LC4k",
  "owner": "bcrist",
  "repo": "Zig-LC4k",
  "description": "Generate ispMach4000 CPLD bitstreams directly from Zig code",
  "type": "project",
  "topics": [
    "cpld",
    "cplds",
    "lattice",
    "zig",
    "zig-library",
    "zig-package",
    "ziglang"
  ],
  "stars": 1,
  "forks": 0,
  "watchers": 1,
  "updated_at": "2025-11-10T02:47:47Z",
  "dependencies": [
    {
      "name": "console_helper",
      "url": "git+https://github.com/bcrist/zig-consolehelper#6b662a6f9294657855eb652f5506eeee645738a7",
      "hash": "console_helper-0.3.1-19g4EypEAACdbhJI9ZkRAXTR7xOalHE2rMiLlqa0zf9N"
    },
    {
      "name": "limp",
      "url": "git+https://github.com/bcrist/limp#9ce429bf22e908a458e8c16481699a898e66d780",
      "hash": "limp-0.2.12-RgAsz0V6DwCHr8Vg8JDJwToznh0B8UhD1UlJUe_UhLkI"
    },
    {
      "name": "re4k",
      "url": "git+https://github.com/bcrist/re4k#ea6c0ce0e24688b5956f25ea4fe04a27fb52f9cf",
      "hash": "re4k-0.1.0-VW5jDM_rwwBplfd6yRRdH5vOr95RuzKEDonKi6dm1X1N"
    }
  ],
  "minimum_zig_version": "0.15.1",
  "readme": "# Lattice ispMach4000 CPLD configuration in Zig\n\nA library for creating and manipulating configuration bitstreams for LC4k CPLDs, using Zig code.\n\nThis project uses reverse-engineered fuse maps from the [RE4k](https://github.com/bcrist/re4k) project.\n\n## Device Support\n\nAll LC4032, LC4064, and LC4128 device variants are supported, including -V, -B, -C, -ZC, and -ZE variants.\nLC4256 and larger devices are not supported at this time.\nAutomotive (LA4xxx) variants may or may not use the same fusemaps as their LC counterparts, but please don't use this project for any automotive or other safety-critical applications.\n\n## Usage\n\nAdd the library to your project through the Zig package manager:\n\n```\nzig fetch --save git+https://github.com/bcrist/zig-lc4k\n```\n\nIn your `build.zig`, you can then add an import for the `lc4k` module:\n\n```zig\nmy_exe.root_module.addImport(\"lc4k\", b.dependency(\"LC4k\", .{}).module(\"lc4k\"));\n```\n\n## Workflow\nTo use the library, you first need to construct one of the device configuration structs defined in the `lc4k` module (e.g. `lc4k.LC4032ZE_TQFP48`).  Usually this is done manually, initializing the macrocells and other configuration necessary to define your design, using Zig code as a low-level pseudo-HDL.  Check the examples directory for more details.  You can also load an existing bitstream/JEDEC file, e.g. for reverse engineering:\n\n```zig\nconst file_contents = try std.fs.cwd().readFileAlloc(allocator, \"path/to/bitstream_file.jed\", 1000000);\nconst bitstream = try lc4k.LC4032ZE_TQFP48.parse_jed(allocator, file_contents);\nconst results = try lc4k.LC4032ZE_TQFP48.disassemble(allocator, bitstream);\nconst chip = results.config;\n```\n\nNote that while this library includes a basic expression parser, it does not and will not support synthesizing a design from Verilog, VHDL, ABEL, or any other HDL.  It is my opinion that such workflows often don't allow sufficient control over how the limited hardware resources are utilized, and designs that will fit in 32-128 macrocell CPLDs are rarely complex enough where such an abstracted representation is necessary.\n\nOnce you have your in-memory representation of the design, you can do a number of things with it:\n\n* Generate an HTML report detailing the design, including timing information.\n* Export the design as a JEDEC or SVF file for programming devices.\n* Simulate your design or write tests to verify its functionality.\n* Write your own Zig code that does whatever you want.\n\n## Logic Parser\nAn expression parser is included as a more convenient way to define the logic to assign to a particular macrocell, compared to manually defining product terms with, e.g. `signal.when_high().pt().and_factor(...)` which can quickly become hard to read.  To use the logic parser, you will need three things:\n* A general purpose allocator used for temporary data needed while parsing (does not retain any allocations between calls to the parser).\n* An arena used to allocate the final results of parsing (arrays of product terms and factors).\n* A `*const Names` used to map identifiers within expressions to device signals.\nFor examples of initializing a parser, check the [examples](https://github.com/bcrist/Zig-LC4k/blob/main/examples/adder/main.zig#L129).\n\nOnce you have a parser, there are several ways to parse an expression:\n* `Logic_Parser.pt(equation, options)`: Generates a single product term, suitable for assignment to a GLB config's `shared_pt_enable`, etc.\n* `Logic_Parser.pt_with_polarity(equation, options)`: Generates a single product term, suitable for assignment to a GLB config's `shared_pt_clock`, etc, where the product term can be inverted to support sum expressions.\n* `Logic_Parser.sum(equation, options)`: Generates an array of product terms, for use when you want to process the results more before using them\n* `Logic_Parser.sum_with_polarity(equation, options)`: Generates an array of product terms suitable for assignment to `five_pt_fast_bypass`, etc, where the result can be inverted to support product-of-sums expressions.\n* `Logic_Parser.logic(equation, options)`: Suitable for assignment to a macrocell config's `logic` field.\n* `Logic_Parser.assign_logic(chip, mc_signals, equation, options)`: Unlike all the previous functions, this form allows the final result of the equation to have multiple bits.  Rather than returning the parsed logic, it will automatically assign each bit of the result to the macrocell logic field corresponding to the same bit in the `mc_signals` array.\n\nWhen the `logic` or `assign_logic` forms are used, it will attempt to use the logic mode which uses the fewest resources:\n* If the equation or its complement use only one product term, then `pt0` or `pt0_inverted` will be used so that the macrocell's other PTs can be routed to another cluster.\n* If the \"top level\" operation in the equation is an XOR, and one side of it (or its complement) uses only one PT, then `sum_xor_pt0` or `sum_xor_pt0_inverted` will be used, unless `sum` or `sum_inverted` would use fewer total PTs.\n* Otherwise `sum` or `sum_inverted` will be used (whichever uses fewer total PTs).\nNote: the `input_buffer` and `sum_xor_input_buffer` modes will never be generated.\n\n### Parser Options\n* `Options.max_product_terms`: Allows limiting the number of product terms that can be produced before an error will be generated.  By default, up to 80 PTs can be generated (the maximum that exist in each GLB)\n* `Options.optimize`: When enabled, expressions will be optimized using the Quine-McCluskey-Petrick method.  This optimization is exponential in time and space complexity, so it is not enabled by default.  When disabled, expressions will be normalized if they are not in sum-of-products form, and many symbolic simplifications will be performed if possible, but there is no guarantee that the minimum number of product terms will be used.\n* `Options.dont_care`: When optimization is enabled, a secondary equation can be provided here to indicate conditions where the result does not matter.  The optimizer may then be able to use fewer product terms.\n\nOptions are passed to the the `Logic_Parser` through an `anytype` parameter.  Arbitrary additional names can be defined in this struct and they can be used in the expression as if they had been defined in the `Names` struct.\nSee the [gray code counter](https://github.com/bcrist/Zig-LC4k/blob/main/examples/gray_code/main.zig#L67) example for a demonstration of this.\n\n### Parser Syntax\n\n```\n;;;; Basics ;;;;\n\n; Anything between a semicolon and the next LF (\\n) character is considered a comment.\n\nabcd ; Identifiers represent named signals or buses, defined by the Names struct.\na123 ; Identifiers may contain ASCII letters, digits, \"_\", \".\", or \"$\" but may not start with a digit.\n\n0    ; Literals are numeric constants representing specific bit patterns.\n123  ; Decimal literals are considered to have the minimum number of bits required to store their value.\n8'0  ; You can specify the number of bits before the literal value by separating them with the\n     ; single-quote ('), similar to Verilog.\n0xFF ; You can specify hex literals with the \"0x\" or \"0h\" prefixes (they are all equivalent).\n#FF  ; You can also use the \"#\" character prefix to indicate a hex literal.\n0o77 ; Octal literals can be specified with \"0o\".\n0b11 ; And binary literals with \"0b\".\n'hFF ; Just \"h\", \"x\", \"o\", or \"b\" works, as long as it's not the very first character of the literal.\n     ; All literals must start with a digit, \"'\", \"-\", or \"#\".\n8'xF ; Hex/octal/binary literal bits = log2(base) * num_digits, but this can be overridden.\n\n(expr) ; Parentheses can be used to group subexpressions.\n\n;;;; Operations ;;;;\n; Listed in order of increasing binding power.\n\nA | B ; Bitwise OR.  A and B must have the same bit width or one of them must have width of 1 bit.\nA + B ; Bitwise OR (alternate style)\nA ^ B ; Bitwise XOR.  A and B must have the same bit width or one of them must have width of 1 bit.\n      ; When mixed, OR and XOR operations are performed from left to right.\n\nA & B ; Bitwise AND.  A and B must have the same bit width or one of them must have width of 1 bit.\nA * B ; Bitwise AND (alternate style)\n\nA == B ; Syntactic sugar for &~(A^B).  A and B must have same width; the result will always be 1 bit.\nA != B ; Syntactic sugar for |(A^B).  A and B must have same width; the result will always be 1 bit.\n\n~ A    ; Ones' complement.  The result will have the same bit width as A.\n! A    ; Ones' complement (alternate style)\n| A    ; Condensing OR.  A may have any bit width; the result will always be 1 bit.\n+ A    ; Condensing OR (alternate style)\n^ A    ; Condensing XOR (even parity generator).  A may have any width; the result will always be 1 bit.\n& A    ; Condensing AND.  A may have any bit width; the result will always be 1 bit.\n* A    ; Condensing AND (alternate style)\n@pad A ; Converts any macrocell feedback signals in A to the corresponding macrocell's I/O pad signal.\n@fb A  ; Converts any macrocell I/O signals in A to the corresponding macrocell's feedback signal.\n\n; Extraction operator:\nA[0]       ; Extract bit 0.  The LSB has index 0.\nA[7 5 3]   ; Extract and concatenate bits 7, 5, and 3.  Bit 3 will be the LSB of the result.\nA[3 5 7]   ; Illegal; indices must be listed in big-endian order to avoid accidentally swapping signals.\nA[>7 5 3]  ; Same as above; explicitly calls out big-endian ordering of concatenation.\nA[7>5>3]   ; Same as above; > can be duplicated and placed anywhere within [ ].\nA[<3 5 7]  ; Same as above; using little-endian ordering.\nA[<7 5 3]  ; Swapping relative order of bits is allowed when endianness is explicit.\nA[7:4]     ; Extract bits 4-7, both endpoints inclusive.  Bit 4 will be the LSB of the result.\nA[>7:4]    ; Same as above; explicitly big-endian.\nA[<4:7]    ; Same as above; explicitly little-endian.\nA[<7:4]    ; Extract bits 4-7, reversed.  Bit 7 will be the LSB and bit 4 the MSB.\nA[>4:7]    ; Same as above; using big-endian ordering.\nA[4:7]     ; Illegal; endianness must be explicit when extracting a reversed range.\nA[:]       ; Endpoints that are omitted are assumed to be either 0 or bits(A)-1.\nA[7 3 1:0] ; Individual bits and ranges can be mixed and matched.\nA[B]       ; Define a mux by using an identifier instead of a constant.  bits(A) must == 2^bits(B).\nA[B C]     ; Illegal; only a single non-constant expression is allowed for muxes.\n\n; Concatenation operator:\n{A B}   ; Concatenate A and B.  B[0] will be the LSB of the result.\n{>A B}  ; Same as above; explicitly calls out big-endian ordering.\n{<A B}  ; Concatenate A and B; little-endian.  A[0] will be the LSB of the result.\n{A B C} ; Any number of expressions can be concatenated at once.\n```\n",
  "owner_avatar_url": "https://avatars.githubusercontent.com/u/2828351?v=4",
  "releases": [],
  "owner_company": null,
  "owner_location": null,
  "owner_blog": "http://magicmoremagic.com",
  "owner_twitter_username": null,
  "owner_followers": 8,
  "owner_following": 0,
  "owner_created_at": "2012-11-18T17:51:58Z",
  "license": "MIT",
  "category": "library"
}