{
  "name": "zitron",
  "owner": "mnemnion",
  "repo": "zitron",
  "description": "Zig-generating LALR(1) YACC-alike based on Lemon",
  "type": "package",
  "topics": [
    "lemon",
    "parsing",
    "parsing-engine",
    "yacc",
    "zig",
    "zig-package",
    "yacc-shave"
  ],
  "stars": 8,
  "forks": 0,
  "watchers": 1,
  "updated_at": "2026-01-09T22:46:24Z",
  "minimum_zig_version": "0.15.2",
  "readme": "# Zitron\n\nZitron[^†] is an [LALR(1)][lalr] parser generator, closely based on\n[Lemon][lem], the parser generator D. Richard Hipp wrote for SQLite.  It\nhas been adopted and modified to produce Zig code.\n\nSo closely is Zitron based on Lemon, in fact, that it includes a\nfull port of Lemon, which has been tested and produces byte-for-byte\nidentical output for numerous Lemon grammars, including that of SQLite\nitself.  While I can think of no actual advantage to using `lemon.zig`\nrather than `lemon.c`, translating the former was an essential step in\nwriting the latter, and I saw no reason to leave it stranded in the\ncommit history.  Let it serve as an artifact showing the fidelity with\nwhich this translation was prepared.  Any bugs in Zitron are almost sure\nto be of my own doing, and, with decent confidence, transpired after the\ntranslation of `lemon.zig`.\n\n## Using Zitron\n\nAs [Yet Another Yet Another Compiler-Compiler][yacc][^‡], Zitron is a complete\nDSL for declaring a parser, and actions to go along with recognition.  A\n[detailed manual](/doc/zitron.md) is included, itself adopted from [the\noriginal][og].\n\nA tokenizer will be necessary.  If you're reading this[^※], a companion lexer\ngenerator does not exist.  It's certainly tractable to roll your own by\nhand.  It may also interest you to know that [re2c][re2c] is able to generate\nZig code, although not, at the time of writing, using labeled switch\ncontinue format.\n\n### Licensing\n\nLemon is in the public domain.  Whether a close technical translation is\neven entitled to a separate copyright is somewhat unclear; for the avoidance\nof doubt, `lemon.zig` is also dedicated to the public domain.\n\nZitron itself is licensed `BSD 0`, which is morally equivalent, and\ncompatible with more international licensing régimes.\n\nSome of the Lemon grammars in the `samples/` directory have their own\nlicenses, which you will find in `samples/licenses/`.\n\n### Editing\n\nThe Zitron format has a [Tree-sitter grammar](https://github.com/mnemnion/tree-sitter-zitron),\nfor your editing convenience.  It's still a bit rough around the edges, so you'll\nneed to manually integrate it with your editor of choice. Smoother user experiences\nmay be forthcoming.\n\n## Future Work\n\nThis project has the great advantage of standing upon the shoulders of a\ngiant.  Lemon parsers run on every smartphone, the great majority of PCs\nand servers, Naval vessels, embedded systems, and much else; the design\nhas proven its merit a myriad times over.\n\nAnd yet I have the temerity to contemplate some changes, to improve the\ndeveloper experience, even perhaps the user experience, of writing and\nrunning Zitron grammars (respectively).  Some of those changes already\nexist!\n\nIt's too early to guarantee that every Zitron grammar written today\nwill be forward-compatible with every Zitron release, down to the last\nbuild flag.  Decent chance it will be, though.  If you find yourself\nrelying on Zitron in a project, I would be most pleased to hear about it,\nand will keep that in consideration in the event of any breaking change.\n\nMost of what I'm contemplating is strictly additive, in any case.  No\npromises, no warranty, as the Lemon manual puts it:\n\n> If it breaks, you get to keep both pieces.\n\n[lalr]: https://en.wikipedia.org/wiki/LALR_parser\n[lem]: https://sqlite.org/lemon.html\n[yacc]: https://en.wikipedia.org/wiki/Yacc\n[og]: https://sqlite.org/src/doc/trunk/doc/lemon.html\n[re2c]: https://re2c.org/manual/manual_zig.html\n\n\n[^†]: The name Zitron is a sort of pan-European compromise between\nseveral spellings of \"citron\", a word which refers to a different citrus\nentirely in English, but to the lemon in those European languages where\nit doesn't sound like 'lemon'.  This artifice, much like the EU, is\nguaranteed to please no one.\n\n[^※]: Safe bet\n\n[^‡]: Which I suppose makes me yet another yet another compiler-compiler\ncompiler.  Hazard of the trade!  Quite the yacc shave, I must admit.\n",
  "owner_avatar_url": "https://avatars.githubusercontent.com/u/231785?u=8a0cdeb97b0a614b0350536ecd6921ee6166c611&v=4",
  "releases": [
    {
      "tag_name": "v0.1.6",
      "name": " Suppress action compression when rule uses %impl",
      "body": "The compression of the action tables is meant to skip rules which\r\nhave associated code, which is tracked by a Boolean flag on the\r\nRule.  Rules where the code action is defined by an `%impl` were not\r\nbeing set correctly, and if they were optimize-able, this would\r\nprevent the action from triggering during the reduction.  The code\r\ntranslation sets this flag, such that the code was _emitted_, but\r\nthis happens after the rule compression, all of which was fairly\r\nmysterious.\r\n\r\nThis has been corrected.",
      "prerelease": false,
      "published_at": "2026-01-09T22:47:32Z",
      "html_url": "https://github.com/mnemnion/zitron/releases/tag/v0.1.6",
      "assets": []
    },
    {
      "tag_name": "v0.1.5",
      "name": "Always decrement stack",
      "body": "The infinite loop was, in fact, a scope error: the stack decrement was\r\nonly executed when the object on the stack had a destructor.\r\n\r\nThis is no longer the case.",
      "prerelease": false,
      "published_at": "2026-01-08T16:28:37Z",
      "html_url": "https://github.com/mnemnion/zitron/releases/tag/v0.1.5",
      "assets": []
    },
    {
      "tag_name": "v0.1.4",
      "name": "Flips boolean flag, errors at end of input don't infinite loop",
      "body": "The sense of an a-bit-clever `@hasDecl` boolean was flipped, affecting the error recovery strategy chosen (default: none, instead of default: default).\r\n\r\nWhen combined with a syntax error consisting of truncated input (that is, the first invalid 'token' is `.end_of_input` / comes from `.finalize()` (same-same)), this triggered an infinite loop.  \r\n\r\nThis release provides the intended default. I am still diagnosing whether the opposite-valence behavior is itself a bug, it involves undocumented features of Lemon which are only mentioned in passing in the Zitron manual. \r\n\r\nIn any case, an unexpected end-of-input syntax error will do the expected thing, provided the \"magic zitron string\" `zitron_no_error_recovery` is not set in the parser code.  I would suggest not doing so, and if you do, throw from a `%parse_failure` block.",
      "prerelease": false,
      "published_at": "2026-01-08T15:53:58Z",
      "html_url": "https://github.com/mnemnion/zitron/releases/tag/v0.1.4",
      "assets": []
    },
    {
      "tag_name": "v0.1.3",
      "name": "Handle destructors with no code",
      "body": "If a type has a destructor, and a reduction of that type has no captures\r\nand no code body, a prefix is generated to run that destructor.  Zitron\r\nincorrectly looked for the code body to gate all of the codegen, not\r\nchecking the prefix, code, and suffix separately.\r\n\r\nThis situation resulted in a reduce action which is malformed Zig, which\r\nhas now been corrected.",
      "prerelease": false,
      "published_at": "2026-01-06T17:24:19Z",
      "html_url": "https://github.com/mnemnion/zitron/releases/tag/v0.1.3",
      "assets": []
    },
    {
      "tag_name": "v0.1.2",
      "name": "Parser fix for `@foo(A)` with no `;`",
      "body": "The parser wanted a `;` even when the rule has no RHS alias,\r\nwhich is unreasonable.  Compounding the problem, error recovery\r\nwas not properly clearing state, triggering a (correct) assertion\r\nwhich would crash the program.\r\n\r\nThe syntax is now accepted, and comparable errors clean up properly,\r\nand hence, will not crash.",
      "prerelease": false,
      "published_at": "2026-01-06T13:59:04Z",
      "html_url": "https://github.com/mnemnion/zitron/releases/tag/v0.1.2",
      "assets": []
    },
    {
      "tag_name": "v0.1.1",
      "name": "Include templates in build.zig.zon",
      "body": "As well as `samples/`, and `docs/`.  That last one may not be\r\nnecessary, but I'd rather not find out.\r\n\r\nSo this release might just build correctly. Please raise an issue if it doesn't!",
      "prerelease": false,
      "published_at": "2025-12-29T15:40:26Z",
      "html_url": "https://github.com/mnemnion/zitron/releases/tag/v0.1.1",
      "assets": []
    },
    {
      "tag_name": "v0.1.0",
      "name": "The Zitron Parser Generator",
      "body": "Initial release.  \r\n\r\nSee [the documentation](https://github.com/mnemnion/zitron/blob/trunk/doc/zitron.md) for details.",
      "prerelease": false,
      "published_at": "2025-12-26T16:30:27Z",
      "html_url": "https://github.com/mnemnion/zitron/releases/tag/v0.1.0",
      "assets": []
    }
  ],
  "owner_company": null,
  "owner_location": "Eastern Standard Tribe",
  "owner_blog": null,
  "owner_twitter_username": null,
  "owner_followers": 94,
  "owner_following": 24,
  "owner_created_at": "2010-03-27T23:31:39Z",
  "homepage": "https://github.com/mnemnion/zitron/blob/trunk/doc/zitron.md",
  "category": "library"
}